Autodesk.Revit.DB.ImageBackgroundSettings.FilePath
File path of the image for the rendering background.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The file specified by path is not an image file.
A valid image file should be in one of the following formats: bmp, jpg, jpeg, png, tif.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
When setting this property: The  file specified by path doesn't exist.
Since:
2013